{
  "main": { 
    "name":"Erick Pena",
    "occupation":"Sotware Engineer",
    "description":"I am a highly motivated profesional with a strong Computer Science background. I am very passionate about programming and I am always looking for new technologies to learn. Seek to pursue a new position with room for advancement alongside a growing team",
    "image":"profilepic.jpeg",
    "bio":"I am an enthusiastic person with a great passion for programming. I graduated from the University of Central Florida in the year 2020 with a bachelor’s degree in computer science. I have been in the work force for more than a year now. In this time I have come to realize that there is a whole world that is yet to be explore. Many opportunities in the this amazing field make me see the future with excitement. Apart from programming some of the activities that keep me busy are learning to play the guitar and taking Portuguese lessons. Feel free to check my work and if you have any question don't hesitate to contact me.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "erick1439@live.com",
    "phone": "(845)-461-9811",
    "address":{
      "city":"Orlando",
      "state":"FL",
      "zip": "32822"
    },
    "website": "https://www.erick-pena.com",
    "resumedownload":"resume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/erick-pena",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/erick1439",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"http://github.com/erick1439",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Some of my skill are:",
    "education":[
      {
        "school":"University of Central Florida",
        "degree":"Bachelor of Computer Science",
        "graduated":"August 2020",
        "description":"This is the institute where I was able to solidify many of my skills. Some of my favorite courses I have taken are parallel computing, computer graphics, and artificial intelligence. Also, during my time here I have been part of the Dean’s List multiple occasions for maintaining a GPA above 3.8."
      },
      {
        "school":"Valencia College",
        "degree":"Associates of Science: Computer Science",
        "graduated":"May 2018",
        "description":"This is the first school I attended toward my degree and where I learned most of my programming fundamentals."
      }
    ],
    "work":[
      {
        "company":"Tata Consultancy Services",
        "title":"Software Engineer",
        "years":"January 2021 - Present",
        "descriptions": ["Develop, create, and modify software applications based on client requirements",
          "Maintain systems by monitoring, identifying, and correcting software defects",
          "Update knowledge and skills though external courses, manuals, and new applications"
        ]
      },
      {
        "company":"XI Media Labs",
        "title":"Software Developer Intern",
        "years":"January 2020 - August 2020",
        "descriptions": ["Collaborated to develop a digital wallet and currency for a mobile dating app called Flairr",
          "Assisted to create RESTful APIs in order to connect the mobile app and cryptocurrency network",
          "Participated with multiple developers in brainstorming future ideas and features for the mobile app"
        ]
      },
      {
        "company":"Self Employed",
        "title":"Computer Science and Math Tutor",
        "years":"January 2019 – March 2020",
        "descriptions": ["Worked closely with UCF students in one-to-one sessions to provide supplemental tutoring",
          "Elaborated different lessons plans to accommodate students at different levels and improve effectiveness",
          "Tutored courses such as Data Structures and Algorithms, Intro to C programming, OOP, and Calculus"
        ]
      },
      {
        "company":"Universal Studios Orlando",
        "title":"Attraction Operator",
        "years":"February 2017 - Present",
        "descriptions": ["Deliver top quality customer service in professional manner while managing multiple tasks",
          "Ensure the proper use of safety practices and procedures while operating the attraction",
          "Evaluate and communicate with co-workers to meet goals and accomplish tasks"
        ]
      }
    ],
    "skills":[
      {
        "name":"Java",
        "level":"96%"
      },
      {
        "name":"JavaScript",
        "level":"92%"
      },
      {
        "name":"C",
        "level":"80%"
      },
      {
        "name":"Mern Stack",
        "level":"85%"
      },
      {
        "name":"HTML & CSS",
        "level":"87%"
      },
      {
        "name":"Git",
        "level":"84%"
      },
      {
        "name":"Microsoft Office",
        "level":"100%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Contacts Manger",
        "description": "This is a friendly responsive website that allows you to store all of your contacts in an organize manner. This project was developed with MongoDB, Express.js, React.js, and Node.js. You can check the app at: https://contacts-website.herokuapp.com",
        "images": ["contactsManager1.png","contactsManager2.png"],
        "links": {"liveDemo": "https://contacts-website.herokuapp.com/" , "github": "https://github.com/erick1439/Contacts"},
        "size": "470"
      },
      {
        "title":"Weather 24/7",
        "description": "This is a responsive website that allows users to check forecast and news of any city of their choice. The website will make use of third-party APIs to gather the all the info that the user requests. You can check the app at: http://weather24-7.herokuapp.com/",
        "images": ["weatherApp1.png", "weatherApp2.png"],
        "links": {"liveDemo": "https://weather24-7.herokuapp.com/" , "github": "https://github.com/erick1439/WeatherApp"},
        "size": "470"
      },
      {
        "title":"SQL-GUI",
        "description": "This is a Java-based GUI application that will connect to your MySQL server via JDBC allowing you to run SQL queries and have visual representation of your data. The application was develop with Java, Java-Swing, and SQL",
        "images": ["SQL-GUI1.png","SQL-GUI2.png"],
        "links": {"liveDemo": "" , "github": "https://github.com/erick1439/SQL-GUI"},
        "size": "470"
      },
      {
        "title":"Character Keep",
        "description": "This forms part of a group project where the application was responsible to generate, collect, and save data from tabletop games such as Warhammer. I was in charge to create the mobile component of the interactive application on Android with the use of Java.",
        "images": ["characterKeeper1.png","characterKeeper2.png"],
        "links": {"liveDemo": "" , "github": ""},
        "size": "470"
      },
      {
        "title":"3D Cell Model",
        "description": "Develop in JavaScript with the help of Three.js, HTML, CSS, and Vectary. This is an interactive 3d project that allows users to learn the anatomy of an animal cell. You can check the app at: https://cell-model-3d.herokuapp.com/",
        "images": ["3dCell1.png","3dCell2.png"],
        "links": {"liveDemo": "https://cell-model-3d.herokuapp.com/" , "github": "https://github.com/erick1439/3d-Cell-Model"},
        "size": "470"
      },
      {
        "title":"Atlantic Trails Resort",
        "description": "Developed with the use of HTML, CSS, JavaScript, and jQuery. This is a friendly responsive website used as the main online tool to represent a vacation Resort.",
        "images": ["atlantic1.png","atlantic2.png"],
        "links": {"liveDemo": "" , "github": "https://github.com/erick1439/Atlantic-Trails-Resort"},
        "size": "470"
      },
      {
        "title":"PL/0 Compiler",
        "description": "Develop in C, this program takes PL/0 instructions then it reads them character by character detecting any syntax errors, then it will parse it, and output the result from many of the logistics operations that was able to perform.",
        "images": [],
        "links": {"liveDemo": "" , "github": ""},
        "size": "470"
      },
      {
        "title":"Durable Queue for Non-Volatile Memory:",
        "description": "This is part of a published research report that explains the scalability from the implementation of a durable queue for non-volatile memory created by my colleagues and me.",
        "images": [],
        "links": {"liveDemo": "" , "github": "https://github.com/erick1439/Multithreading-Elimination-Stack"},
        "size": "470"
      },
      {
        "title":"React Native Login System",
        "description": "This is an example of a project that I decided to create to explore and learn more about the React Native. To authenticate users I am using Google's Firebase tools to get familiar with their authentication system.",
        "images": ["reactNativeLogin1.png","reactNativeLogin2.png","reactNativeLogin3.png"],
        "links": {"liveDemo": "" , "github": "https://github.com/erick1439/React-Native-Login-System"},
        "size": "200"
      }
    ]
  }
}
