{
  "main": { 
    "name":"Erick Pena",
    "occupation":"Sotware Engineer",
    "description":"I am a highly motivated professional with a strong Computer Science background. Seeking to pursue a new position with room for advancement alongside a growing team",
    "image":"profilepic.jpg",
    "bio":"I am an enthusiastic professional with a great passion for programming. I graduated from the University of Central Florida in the year 2020 with a bachelor’s degree in computer science. I have been in the tech workforce for more than 3 years now and I have come to realize that there is a whole world that is yet to be explored. Many opportunities in this amazing field make me see the future with excitement. Apart from programming some of the activities that keep me busy are learning to play the guitar and taking Portuguese lessons. Feel free to check my work and if you have any questions don't hesitate to contact me.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "erick1439@live.com",
    "phone": "(845)-461-9811",
    "address":{
      "city":"Orlando",
      "state":"FL",
      "zip": "32822"
    },
    "website": "https://resume.erick-pena.com",
    "resumedownload":"resume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/erick-pena",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/erick1439",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"http://github.com/erick1439",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Some of my skill are:",
    "education":[
      {
        "school":"University of Central Florida",
        "degree":"Bachelor of Computer Science",
        "graduated":"August 2020",
        "description":"This is the institute where I was able to solidify many of my skills. Some of my favorite courses I have taken are parallel computing, computer graphics, and artificial intelligence. Also, during my time here I have been part of the Dean’s List on multiple occasions for maintaining a GPA above 3.8."
      },
      {
        "school":"Valencia College",
        "degree":"Associates of Science: Computer Science",
        "graduated":"May 2018",
        "description":"This is the first school I attended toward my degree and where I learned most of my programming fundamentals."
      }
    ],
    "work":[
      {
        "company":"Tata Consultancy Services / Pearson",
        "title":"Software Engineer",
        "years":"January 2022 - Present",
        "descriptions": ["Developed and maintained payment portal to allow teachers from more than 80,000+ learning institutions nationwide to obtain educational certifications",
          "Developed multithreading algorithms to improve time efficiency from data processing operations by up to 35% from previous single threading implementations",
          "Developed user interface application to help admin user visualize big amounts of data in an easy and consice way"
        ]
      },
      {
        "company":"Tata Consultancy Services / Comcast",
        "title":"Software Engineer Analyst",
        "years":"January 2021 - Dec 2021",
        "descriptions": ["Worked with technical team to maintain application that is used to provide services and solutions to more than 2 million businesses",
          "Tested software before deployment for bugs, speed, and efficiently reducing the number of reported complaints by 14%",
          "Created additional training material to help new co-workers accelerate their training process from 3 to 2 weeks; the training material is still in use to this day, and it has helped 15+ employees"
        ]
      },
      {
        "company":"Flairr Labs",
        "title":"Software Developer",
        "years":"January 2020 - Nov 2020",
        "descriptions": ["Developed cryptocurrency using DAG technology which helped to improve the number of transactions from 4 to 230 transactions per second from previous blockchain implementation",
          "Develop set of APIs to connect gaming mobile app to cryptocurrency network to distribute 100,000+ virtual coins to users who successfully complete augmented-reality challenges",
          "Recognized by UCF’s CECS showcase as an innovative project and made an appearance in local news"
        ]
      },
      {
        "company":"Self Employed",
        "title":"Computer Science and Math Tutor",
        "years":"January 2019 – March 2020",
        "descriptions": ["Worked closely with UCF students to provide supplemental tutoring",
          "Elaborated different lesson plans to accommodate students at different levels and improve the effectiveness",
          "Tutored courses such as Data Structures and Algorithms, Intro to C programming, OOP, and Calculus"
        ]
      },
      {
        "company":"Universal Studios Orlando",
        "title":"Attraction Operator",
        "years":"February 2017 - Present",
        "descriptions": ["Deliver top-quality customer service in a professional manner while managing multiple tasks",
          "Ensure the proper use of safety practices and procedures while operating the attraction",
          "Evaluate and communicate with co-workers to meet goals and accomplish tasks"
        ]
      }
    ],
    "skills":[
      {
        "name":"Java",
        "level":"96%"
      },
      {
        "name":"JavaScript",
        "level":"92%"
      },
      {
        "name":"Python",
        "level":"85%"
      },
      {
        "name":"C",
        "level":"80%"
      },
      {
        "name":"Mern Stack",
        "level":"85%"
      },
      {
        "name":"HTML & CSS",
        "level":"87%"
      },
      {
        "name":"Git",
        "level":"90%"
      },
      {
        "name":"Microsoft Office",
        "level":"100%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"YT-Summarizer",
        "description": "This project is a Google Chrome extension which provides the user a small paragraph that summarize a clicked YouTube video without  the user needing to play the video. The goal of the application is to give the user the ability to see if the video is of their interest and avoid “click bait”. The application also has the feature to find timestamps when specific words  are mentioned, give lists of the most used words in the video, and an option to get the full transcript of the video.  This project uses node.js, AWS Lambda, and ChatGPT's AI capabilities.",
        "images": ["yt-summarizer1.png","yt-summarizer2.png"],
        "icons": [
          { 
            "name":"YT-Summarizer",
            "url":"https://chrome.google.com/webstore/detail/yt-summarizer/figelpohbejmbenpbhjciincbkafoekg?hl=en",
            "className":"fa fa-globe"
          }
        ],
        "size": "470"
      },
      {
        "title":"Visual Game Solver",
        "description": "This project consists of a website that will solve popular puzzles games showing a visual representation of how they get solved by a computer. At the moment you can see how computers can solve sudoku boards, mazes, and sort lists using sorting and backtracking algorithms. This project was developed with React.js, Express.js, and Node.js.",
        "images": ["visualGameSolver1.png", "visualGameSolver2.png", "visualGameSolver3.png"],
        "icons": [
          { 
            "name":"website-contacts",
            "url":"https://erick1439.github.io/visual-game-solver-client/",
            "className":"fa fa-globe"
          }, 
          {
            "name":"github-contacts",
            "url":"https://github.com/erick1439/VisualGameSolver",
            "className":"fa fa-github"
          }
        ],
        "size": "470"
      },
      {
        "title":"Contacts Manger",
        "description": "This is a friendly responsive website that allows you to store all of your contacts in an organized and concise manner. The application allows login, registration, and CRUD operations. This project was developed with MongoDB, Express.js, React.js, and Node.js.",
        "images": ["contactsManager1.png","contactsManager2.png"],
        "icons": [
          { 
            "name":"website-contacts",
            "url":"https://erick1439.github.io/Contacts-app-client",
            "className":"fa fa-globe"
          }, 
          {
            "name":"github-contacts",
            "url":"https://github.com/erick1439/Contacts",
            "className":"fa fa-github"
          }
        ],
        "size": "470"
      },
      {
        "title":"3D Cell Model",
        "description": "This is an interactive 3d project that allows users to navigate, explore, and learn the anatomy of an animal cell. The user is able to pinpoint a particular area of the cell and learn how an individual component works. This project makes use of raycasting to pinpoint elements and the use of different algorithms to manipulate and render the textures and objects in the screen. The project was developed in Node.js, Three.js, and React.js",
        "images": ["3dCell1.png","3dCell2.png"],
        "icons": [
          { 
            "name":"website-cell",
            "url":"https://erick1439.github.io/3d-Cell-Model/",
            "className":"fa fa-globe"
          }, 
          {
            "name":"github-cell",
            "url":"https://github.com/erick1439/3d-Cell-Model",
            "className":"fa fa-github"
          }
        ],
        "size": "470"
      },
      {
        "title":"Weather 24/7",
        "description": "This is a responsive website that allows users to check forecasts and news of their current location and any other city of their choice. The website will make use of third-party APIs to gather all the required information and display it in a friendly and organized manner. This project was developed with React.js and Node.js.",
        "images": ["weatherApp1.png", "weatherApp2.png"],
        "icons": [
          { 
            "name":"website-weather",
            "url":"https://weather24-7.herokuapp.com/",
            "className":"fa fa-globe"
          }, 
          {
            "name":"github-weather",
            "url":"https://github.com/erick1439/WeatherApp",
            "className":"fa fa-github"
          }
        ],
        "size": "470"
      },
      {
        "title":"Character Keep",
        "description": "This is part of a group project where the application is responsible to generate, collect, and save data from tabletop games such as Warhammer. I was in charge to create the mobile component of the interactive application on Android with the use of Java and SQL. ",
        "images": ["characterKeeper1.png","characterKeeper2.png"],
        "icons": [
          {
            "name":"github-character-keep",
            "url":"https://github.com/erick1439/CharacterKeep",
            "className":"fa fa-github"
          }
        ],
        "size": "470"
      },
      {
        "title":"SQL-GUI",
        "description": "This is a Java-based GUI application that will connect to your MySQL server via JDBC allowing you to run SQL queries and have a visual representation of your data. The application was developed with Java, Java-Swing, and SQL.",
        "images": ["SQL-GUI1.png","SQL-GUI2.png"],
        "icons": [
          {
            "name":"github-sql-gui",
            "url":"https://github.com/erick1439/SQL-GUI",
            "className":"fa fa-github"
          }
        ],
        "size": "470"
      },
      {
        "title":"Atlantic Trails Resort",
        "description": "This is a friendly responsive website used as the main online tool to represent a vacation Resort. The website allows the user to contact the resort and navigate through the activities offered throughout the day. This is the first website I created; It allowed me to learn some fundametal technologies in web development such as: HTML, CSS, JavaScript, and jQuery.",
        "images": ["atlantic1.png","atlantic2.png"],
        "icons": [
          { 
            "name":"atlantic trails resort website",
            "url":"https://erick1439.github.io/Atlantic-Trails-Resort/",
            "className":"fa fa-globe"
          }, 
          {
            "name":"github-atlantic",
            "url":"https://github.com/erick1439/Atlantic-Trails-Resort",
            "className":"fa fa-github"
          }
        ],
        "size": "470"
      },
      {
        "title":"React Native Login System",
        "description": "This is an example of a project that I decided to create to explore and learn more about React Native. To authenticate users I am using Google's Firebase tools to get familiar with their authentication system.",
        "images": ["reactNativeLogin1.png","reactNativeLogin2.png","reactNativeLogin3.png"],
        "icons": [
          {
            "name":"github-reactNative-login",
            "url":"https://github.com/erick1439/React-Native-Login-System",
            "className":"fa fa-github"
          }
        ],
        "size": "200"
      },
      {
        "title":"PL/0 Compiler",
        "description": "PL/0 is a compiler built-in C  that is able to read instructions character by character detecting any syntax errors, parsing it, and outputting results from many logistics operations that the program is able to perform.",
        "images": [],
        "icons": [],
        "size": "470"
      },
      {
        "title":"Durable Queue for Non-Volatile Memory:",
        "description": "This is part of a published research report that explains the scalability from the implementation of a durable queue for non-volatile memory created by my colleagues and me. This project is developed in Java.",
        "images": [],
        "icons": [
          {
            "name":"github-durable-queue",
            "url":"https://github.com/erick1439/Multithreading-Elimination-Stack",
            "className":"fa fa-github"
          }
        ],
        "size": "470"
      }
    ]
  }
}
